case_up_half_cube_26/0.orig/alphat
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 6.66e-05;

boundaryField
{
    left
    {
        type            symmetryPlane;
    }
    right
    {
        type            calculated;
        value           uniform 6.66e-05;
    }
    top
    {
        type            calculated;
        value           uniform 6.66e-05;
    }
    bottom
    {
        type            compressible::alphatWallFunction;
        Prt             0.85;
        value           uniform 6.66e-05;
    }
    front
    {
        type            symmetryPlane;
    }
    back
    {
        type            calculated;
        value           uniform 6.66e-05;
    }
    walls
    {
        type            compressible::alphatWallFunction;
        Prt             0.85;
        value           uniform 6.66e-05;
    }
    source
    {
        type            calculated;
        value           uniform 6.66e-05;
    }
    nozzle_wall_rest
    {
        type            compressible::alphatWallFunction;
        Prt             0.85;
        value           uniform 6.66e-05;
    }
}


// ************************************************************************* //
